{

  "recipes": [
  {
  "_id": "64bac19be07ffc9ef4d57b79",
  "images": [
  "https://imagesvc.meredithcorp.io/v3/jumpstartpure/image/?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2022%2F12%2F13%2FThousand-Layer-Chocolate-Brioche-2000.jpg&w=640&h=360&q=90&c=cc",
  "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F57c308fca125268d18d2e0aa69957951%2F16723518467622022-12-29-13-35-56.jpg&q=60&c=sc&orient=true&poi=auto&h=512",
  "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F57c308fca125268d18d2e0aa69957951%2F167631220329020221228_170339.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
  ],
  "video": "",
  "name": "Thousand Layer Chocolate Brioche",
  "description": "This pastry is light, buttery, and filled with rich chocolate, much like a chocolate croissant, only this version is braided and twisted to make a nice muffin sized treat.You could just add that amount of butter into the dough, so as not to be cheated, but fair warning, a dough with that much fat will rise very slowly, so plan accordingly. Feel free to stuff these with other goodies like nuts and dried fruit instead of, or in addition to, the chocolate chunks, but just be careful not to over fill. No matter if, or how, you personalize yours, I really do hope you give these a try soon. Enjoy!",
  "category": "veg",
  "ingredients": " ¾ cup warm whole milk| 1 package active dry yeast| 4½ cups all-purpose flour| 3 large eggs, beaten| ⅓ cup white granulated sugar| 1 teaspoon fine salt| 6 tablespoons unsalted butter, very soft 4 tablespoons unsalted butter for laminating dough| ½ cup dark chocolate chunks| 1 large whole egg for brushing| coarse sea salt| white granulated sugar",
  "directions": "Combine warm milk and dry active yeast in the bowl of your stand mixer; let stand for 10 minutes. Add flour, eggs, sugar, and salt. Use the dough hook to knead the mixture until the flour almost disappears, about 1 minute. Add the soft room temperature butter, and continue kneading the dough until a very smooth ball of dough forms, 4 to 5 minutes.| Set dough into a lightly buttered bowl, cover, and let rise in a warm spot until doubled in size, 2 to 3 hours.| Punch down the dough and divide in 2 pieces. Form each half into a smooth ball and transfer each one into a plastic bag. Refrigerate bags overnight for best results or the dough can be used immediately. Each half of the dough will make 4 brioche.| When ready to make, roll and stretch dough into a 14 x 10 inch rectangle. Spread 4 tablespoons of soft room temperature butter over two thirds of the dough, stopping 1/2 inch from the edge.| Fold unbuttered third up over the top, and then the opposite end to complete the trifold. Gently press and seal the edges together. Fold in thirds again to form a square. Wrap and place in the freezer until cold and slightly firm, about 15 minutes.| Roll the dough out into a rectangle about 1/4 inch thick, or thin enough to fold, and repeat the two folding in thirds step. Wrap and place in the freezer again until cold and slightly firm, 15 more minutes. A little bit of water can be used to help the dough stick if needed.| Roll dough out into a rectangle again, just like in the previous step. Fold into thirds, but keep as a rectangle (do not make the second fold). Wrap and place in the freezer until cold and slightly firm, about 15 minutes.| Roll dough into a 12 x 6 inch rectangle and place in the freezer until cold and slightly firm, about 15 minutes.| Trim off about 1/8 inch of dough from the sides and cut into 4 rectangles that are about 6 x 3 inches.| Start with 1 piece (keeping the others in the fridge so they stay cool) and make two cuts starting 1/2 inch from top, all the way to the bottom to create 3 strips of dough. Braid together, and seal at bottom. Flip over and add about 1 tablespoon of dark chocolate chunks along the center of the braided dough, or more to taste. Roll up from the smaller end to create a knot. Place seam side down in buttered muffin tin.| After all braids are done, cover, and let rise in a warm spot until doubled in size, about 1 hour.| Preheat the oven to 400 degrees F (200 degrees C).| Brush brioche with egg wash, and sprinkle very lightly with some coarse salt. Then sprinkle very generously with the granulated sugar.| Bake on the center rack of the preheated oven until nicely browned, 20 to 25 minutes. If brioches are getting too dark, tent with aluminum foil after 15 minutes.| Let cool in the pan for about 5 minutes and then transfer onto a rack to cool completely before serving.",
  "course": "Breakfast",
  "rating": 5,
  "timeRequired": "5hrs 40 mins",
  "nutrients": {
  "calories": 521,
  "fat": 22,
  "carbs": 71,
  "proteins": 12
  },
  "like": [],
  "comment": [" very good food","awsome","is it healthy?"],
  "createdAt": "23 July 2023"
  },
  {
  "_id": "64bac19be07ffc9ef4d57b7a",
  "images": [
  "https://www.allrecipes.com/thmb/_Dc9IQf5-ncGCt4rwXiskSJhdMk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7505885_Parmesan-Chive-Biscuits-Orsi_4x3-bc7b1d1b3eac47b8ba7f5c3f021f4071.jpg",
  "https://leitesculinaria.com/wp-content/uploads/2023/03/savory-parmesan-cheese-biscuits-2-1.jpg",
  "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR9eAU5Z9fAF9yN1ZKIGHT4FTeEqmDD3ehcnYYCCdJmJXQCH5m3kAL9asyfT7nLauxYYQA&usqp=CAU"
  ],
  "video": "",
  "name": "Parmesan Chive Biscuits",
  "description": "These savory Parmesan chive biscuits can go with nearly any dinner main, or will be a superb addition to the brunch buffet.",
  "category": "veg",
  "ingredients": "1 cup all-purpose flour|1/2 cup packed shredded Parmesan cheese|2 tablespoons thinly sliced chives|1 teaspoon baking powder|1/2 teaspoon salt|1/4 teaspoon baking soda|1/4 teaspoon freshly ground black pepper|1/3 cup cold sour cream|1/4 cup plus 1 tablespoon cold milk|2 tablespoons unsalted butter, melted, for brushing on biscuit tops",
  "directions": "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.| In a bowl, whisk together flour, Parmesan, chives, baking powder, salt, baking soda, and pepper.| Stir in sour cream until the mixture resembles coarse grains. Add milk and fold until it just comes together. Scoop the batter by the 1/4 cup using a cookie scoop or an ice cream scoop onto the prepared baking sheet, 1 inch apart.| Bake in the preheated oven for 15 minutes. Remove and brush with melted butter. Bake until golden brown, 5 to 7 minutes more",
  "course": "Breakfast",
  "rating": 4.4,
  "timeRequired": "30 mins",
  "nutrients": {
  "calories": 170,
  "proteins": 9,
  "carbs": 18,
  "fat": 5
  },
  "like": [],
  "comment": [],
  "createdAt": "23 July 2023"
  },
  {
  "_id": "64bac19be07ffc9ef4d57b7b",
  "images": [
  "https://www.allrecipes.com/thmb/Jhp5N-YMx7h2I7J29FV9PcGFmBw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/6755615-shrimp-and-scallop-crepes-lutzflcat-4x3-1-1a0cb550095b49d2bed47e4e96f8526f.jpg",
  "https://i.pinimg.com/474x/8e/5e/04/8e5e046c500b32a0c48697cdb828575a--shrimp-crepes-crepe-bar.jpg",
  "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQgBrfiZE3WSY24wq33GsYBDX4w5kcIacM7TqlYHELCgM0skMAzcQqhu_BmkufrxPrt8Nc&usqp=CAU"
  ],
  "video": "",
  "name": "Shrimp and Scallop Crepes",
  "description": "These shrimp and scallop crepes are a seafood lover's dream and will make the taste buds happy. Garnish with more sliced green onion if desired.",
  "category": "veg",
  "ingredients": "2 cups milk1 cup all-purpose flour3 large eggs4 tablespoons melted butter, divided|1 tablespoon butter|6 ounces medium shrimp - peeled, deveined, and cut into 1/2-inch pieces|6 ounces bay scallops|1 teaspoon butter|1 cup sliced mushrooms|½ cup thinly sliced green onions|4 tablespoons butter|4 tablespoons all-purpose flour|1 cup milk, or more as needed|1 cup chicken broth|⅓ cup grated Swiss cheese|¼ cup dry white wine|1 tablespoon sherry (Optional)|salt and ground black pepper to taste",
  "directions": "Combine milk, flour, eggs, and melted butter in a blender. Process until smooth, for at least 1 minute. Set aside and let rest for 30 minutes.|Coat a crepe pan or nonstick small skillet with melted butter. Pour in 1/4 cup crepe batter and swirl the pan until entire bottom is covered in a thin layer of batter. Cook until small brown spots appear on the bottom of the crepe, 1 to 2 minutes.|Loosen crepe carefully from the pan using a spatula and gently flip to brown the other side, 1 to 2 minutes more. Slide crepe onto a plate. Repeat with remaining batter, re-buttering the pan as needed and stacking crepes onto the plate.|Melt 1 tablespoon butter in a skillet over medium heat. Add shrimp and scallops and cook until shrimp are bright pink on the outside and scallops are golden, 2 to 3 minutes. Remove from skillet.|Melt 1 teaspoon butter in the same skillet and increase heat to medium-high. Add mushrooms and green onions; saute until mushrooms are tender, 3 to 4 minutes. Remove from heat.|Melt 4 tablespoons butter in a saucepan over medium heat until bubbling. Whisk in flour until mixture becomes paste-like and lightly golden, about 2 minutes. Add milk and chicken broth and whisk until sauce is smooth and thickened. Thin out with more milk if needed.|Add Swiss cheese, wine, and sherry to the sauce; stir until cheese melts. Season with salt and pepper. Reserve 2/3 cup sauce. Add shrimp, scallops, mushrooms, and onions to the remaining 1/3 of the sauce and stir until heated through.|Spoon about 1/4 cup of the filling across the lower third of each crepe. Roll crepes up jellyroll-style and serve at the table with the reserved sauce.",
  "course": "Breakfast",
  "rating": 4,
  "timeRequired": "1 hr 10 mins",
  "nutrients": {
  "calories": 450,
  "fat": 25,
  "carbs": 29,
  "proteins": 24
  },
  "like": [],
  "comment": [],
  "createdAt": "23 July 2023"
  },
  {
  "_id": "64bac19be07ffc9ef4d57b7c",
  "images": [
  "https://i.ytimg.com/vi/g3u_7v1RW0Q/maxresdefault.jpg",
  "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS5TxvNcTJGqgWSNe6ZP_5g4_WmweQUOCsDegvsTjC71G9hTlHdR4SkyHwRu5xo2n1tnms&usqp=CAU",
  "https://imagesvc.meredithcorp.io/v3/jumpstartpure/image/?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc82c7bbc-6167-4352-bb3b-f831efdf8a5b%2Fb9fb5d8d-7972-4459-bb98-29ac6f2ccb43%2F1280x720%2Fmatch%2Fimage.jpg&w=640&h=360&q=90&c=cc"
  ],
  "video": "",
  "name": "Crispy Fried Poached Eggs",
  "description": "This wow-worthy dish is inspired by an appetizer I once had at a restaurant and couldn't stop dreaming out. This recipe is a bit more challenging than your average egg dish, but tasting the crispy outer crust next to the smooth, silky yolk is worth all the effort! You can garnish with whatever toppings you want, but pickled red onions will offer a pop of brightness to cut through the richness.",
  "category": "non-veg",
  "ingredients": "4 large fresh eggs|2 tablespoons white vinegar|4 cups vegetable oil|1 ½ cups all-purpose flour|2 large eggs, lightly beaten|2 teaspoons salt|1 teaspoon freshly ground black pepper|1 ½ cups panko bread crumbs|2 tablespoons chopped pickled red onions (for garnish)|2 tablespoons chopped green onions (for garnish)|1 tablespoon red pepper flakes for garnish, or to taste",
  "directions": "Fill a saucepan with cold water and place over medium heat. Stir in vinegar and bring to a gentle, slow simmer. Working with one egg at a time, crack an egg into a ramekin or measuring cup for easier transfer.|Stir the water vigorously to create a whirlpool effect. As the whirlpool is turning, drop the egg into the center of the water. Continue to stir gently, cooking until the egg white turns opaque. Using a slotted spoon, carefully remove the egg from the water and move to a paper towel-lined plate to drain.|In a medium saucepan, heat oil to 375 degrees F (190 degrees C).|Meanwhile, set up a dredging station with 3 separate bowls. To the first bowl, add the flour. Beat 2 eggs with salt and pepper in a second bowl. Add breadcrumbs to the third bowl. Carefully dip the cooled egg first into the flour, second into the egg mixture, and last into the breadcrumbs, coating egg on all sides at each station.|Using a slotted spoon, carefully drop the egg into the hot oil and fry until golden brown, 2 to 3 minutes, being careful not to overcook. Drain on a paper-towel lined plate.|Garnish with pickled red onions, green onions, and red pepper flakes. Serve immediately.",
  "course": "Breakfast",
  "rating": 4.2,
  "timeRequired": "27 mins",
  "nutrients": {
  "calories": 2321,
  "fat": 228,
  "carbs": 67,
  "proteins": 19
  },
  "like": [],
  "comment": [],
  "createdAt": "23 July 2023"
  },
  {
  "_id": "64bac19be07ffc9ef4d57b7d",
  "images": [
  "https://www.allrecipes.com/thmb/EwjgIQOTREUPmDPhO5uvs23iF_o=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7557506_Bacon-Egg-and-Cheese-Sandwich_Thedailygourmet_4x3-96273724754c4b59985d2e5b75355f23.jpg",
  "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSVcsAoSWc5wKZikuZy1aARYqqPaGTgvVTNxg&usqp=CAU",
  "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRnG4Y_Pvka8Ax87qA4fuDlbpSU5FW0yzHCrw&usqp=CAU"
  ],
  "video": "",
  "name": "Bacon, Egg, and Cheese Sandwich",
  "description": "If you know how to make an omelet, you will be able to make this bacon, egg, and cheese breakfast sandwich. There's so little prep work required that breakfast will be done before you know it!",
  "category": "non-veg",
  "ingredients": "2 slices bacon|4 teaspoons butter, divided|3 large eggs|1 pinch freshly ground black pepper|1 pinch salt|1/4 cup shredded Cheddar cheese|4 slices bread",
  "directions": "Place bacon in a nonstick skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 7 minutes. Drain bacon slices on paper towels. Remove bacon to a drip line tray. Drain off bacon grease for another use. Wash out the skillet.|Whisk eggs with salt and pepper in a small bowl until frothy.|Melt 2 teaspoons butter in the nonstick skillet over medium heat. Pour in beaten eggs; let cook for 30 seconds. Lift the edges of the omelet so that the uncooked egg runs under the cooked edges and comes into contact with the hot skillet. Shake and tilt the skillet to move the uncooked egg. Repeat until the top is set, about 3 minutes; reduce heat to low. |Meanwhile, chop bacon roughly; sprinkle over omelet. Sprinkle with cheese; allow cheese to melt, 1 to 2 minutes. |Meanwhile, butter 2 slices of bread with 1/2 teaspoon butter each. Lay bread, buttered side up, side-by-side over omelet, leaving about 1 inch between slices. The melted cheese will help the bread adhere.|Run a spatula around the entire omelet to loosen from the skillet. Carefully turn the omelet over so buttered side of bread is in contact with the skillet. Cook until bread is toasted and golden, about 2 minutes.|Using the spatula, fold in edges of omelet to align with sides of the bread. Cut omelet along center with the spatula to form 2 sandwiches. Butter 2 remaining bread slices with remaining butter; place butter side up on each sandwich. Turn sandwiches; cook until golden, about 2 minutes more. Serve and enjoy immediately!",
  "course": "Breakfast",
  "rating": 4.3,
  "timeRequired": "20 mins",
  "nutrients": {
  "calories": 451,
  "fat": 26,
  "carbs": 32,
  "proteins": 22
  },
  "like": [],
  "comment": [],
  "createdAt": "23 July 2023"
  },
  {
  "_id": "64bac19be07ffc9ef4d57b7e",
  "images": [
  "https://imagesvc.meredithcorp.io/v3/jumpstartpure/image/?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Feb0b6664-c191-4e28-bbc0-39f759089fc6%2F14901ad5-1b49-42d6-a480-fb75a0f9d806%2F1280x720%2Fmatch%2Fimage.jpg&w=640&h=360&q=90&c=cc",
  "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9136773.jpg&q=60&c=sc&orient=true&poi=auto&h=512",
  "https://www.allrecipes.com/thmb/sUsXkXZkIi7SRlasL361wd8EJdU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/2206436-d0018545bcb545b6b98c1a23659777cf.jpg"
  ],
  "video": "",
  "name": "Grilled Cheese Sandwich",
  "description": "Learn how to make a grilled cheese sandwich in a nonstick pan with buttered bread and American Cheddar for a classic hot sandwich.Everyone needs to know how to make a classic grilled cheese sandwich. Whether you're a beginner cook or an old pro, you'll come back to this top-rated grilled cheese recipe again and again.",
  "category": "veg",
  "ingredients": "4 slices white bread|3 tablespoons butter, divided|2 slices Cheddar cheese",
  "directions": "Preheat a nonstick skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side down in the hot skillet; add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side up on top of cheese.| Cook until lightly browned on one side; flip over and continue cooking until cheese is melted. Repeat with remaining 2 slices of bread, butter, and slice of cheese.",
  "course": "Lunch",
  "rating": 4.3,
  "timeRequired": "15 mins",
  "nutrients": {
  "calories": 400,
  "fat": 28,
  "carbs": 26,
  "proteins": 11
  },
  "like": [],
  "comment": [],
  "createdAt": "23 July 2023"
  },
  {
  "_id": "64bac19be07ffc9ef4d57b7f",
  "images": [
  "https://www.allrecipes.com/thmb/ZIn_GKfo0SS9P-dcyMEk4s1M1NQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/AllrecipesSalmonBowl-1-SaraHaas-4x3-1-58e05b9d5ea94027be97587c8a04a603.jpg",
  "https://iamafoodblog.b-cdn.net/wp-content/uploads/2021/10/tiktok-salmon-7571.webp",
  "https://iamafoodblog.b-cdn.net/wp-content/uploads/2021/10/tiktok-salmon-7582.webp"
  ],
  "video": "",
  "name": "TikTok Salmon Bowl",
  "description": "Last night's leftovers become lunch-time magic with this TikTok-inspired Salmon Bowl created by Emily Mariko. A quick trip in the microwave reheats the salmon and rice (you'll love the accompanying ice cube trick), then it's all about the toppings! Soy sauce, sriracha and Kewpie mayonnaise get mixed in for a perfectly spicy sauce. Pair it with umami-rich nori and kimchi, and you've got an epic lunch.",
  "category": "veg",
  "ingredients": "3 ounces cooked salmon, flaked|1 cup cooked white rice|1 tablespoon soy sauce|½ teaspoon sriracha or other hot sauce|2 teaspoons Japanese mayonnaise (such as Kewpie®)|1 sheet nori, torn|½ ripe avocado, sliced|¼ cup kimchi",
  "directions": "Use a fork to flake salmon onto a microwave-safe plate. Top with rice and place 1 ice cube on top. Cover with a microwave-safe lid and microwave at low power for 30 seconds. Uncover and check temperature. If salmon and rice are not warm enough, cover and return to the microwave for another 30 seconds at low power.|Uncover and remove ice cube. Drizzle soy sauce, Sriracha and mayonnaise over the top and toss everything with a fork until well-combined.|Garnish with torn pieces of nori, sliced avocado and kimchi.",
  "course": "Lunch",
  "rating": 4,
  "timeRequired": "5 mins",
  "nutrients": {
  "calories": 645,
  "fat": 33,
  "carbs": 62,
  "proteins": 26
  },
  "like": [],
  "comment": [],
  "createdAt": "23 July 2023"
  },
  {
  "_id": "64bac19be07ffc9ef4d57b80",
  "images": [
  "https://imagesvc.meredithcorp.io/v3/jumpstartpure/image/?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fe313eefe-89c2-4e93-9c65-a727683cc141%2Fa850ee01-45b9-4981-aab3-0e6b89641ccf%2F1280x720%2Fmatch%2Fimage.jpg&w=640&h=360&q=90&c=cc",
  "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F494e0299a9d1deedba534c041aa9ed18%2F1666724865007best-bean-salad.jpg&q=60&c=sc&orient=true&poi=auto&h=512",
  "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8319049.jpg&q=60&c=sc&orient=true&poi=auto&h=512"
  ],
  "video": "",
  "name": "Best Bean Salad",
  "description": "This bean salad is delicious. I'd turned my nose up at this for years, but suddenly I can't get enough of it. Thanks, Momma D!",
  "category": "veg",
  "ingredients": "1 (15.5 ounce) can garbanzo beans, drained|1 (14.5 ounce) can kidney beans, drained|1 (14.5 ounce) can black beans, drained|1 (14.5 ounce) can green beans, drained|1 (14.5 ounce) can wax beans, drained|½ cup chopped green pepper|½ cup chopped onion|½ cup chopped celery|¾ cup white sugar|½ cup salad oil|½ cup vinegar|½ teaspoon salt|½ teaspoon ground black pepper",
  "directions": "Gather all ingredients.|Combine garbanzo beans, kidney beans, black beans, green beans, wax beans, green pepper, onion, and celery in a large bowl; toss to mix.|Whisk together sugar, oil, vinegar, salt, and pepper in a separate bowl until sugar is dissolved; pour over bean mixture. Mix well.|Refrigerate salad for 8 hours to overnight before serving.",
  "course": "Lunch",
  "rating": 5,
  "timeRequired": "8 hrs 20 mins",
  "nutrients": {
  "calories": 167,
  "fat": 7,
  "carbs": 24,
  "proteins": 4
  },
  "like": [],
  "comment": [],
  "createdAt": "23 July 2023"
  },
  {
  "_id": "64bac19be07ffc9ef4d57b81",
  "images": [
  "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fb505424140f0fc4ef04c3c6f0e32d88f%2F168342303756520230506_164316.jpg&q=60&c=sc&orient=true&poi=auto&h=512",
  "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fc9cc7bfcfd1d0fd4a4bd46fd23253944%2F1657488355IMG_20220710_172115876.jpg&q=60&c=sc&orient=true&poi=auto&h=512",
  "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fc9cc7bfcfd1d0fd4a4bd46fd23253944%2F1646846645IMG_0034.jpg&q=60&c=sc&orient=true&poi=auto&h=512"
  ],
  "video": "",
  "name": "Old-Fashioned Potato Salad",
  "description": "This potato salad recipe is for the traditional creamy type of potato salad, with eggs, celery, and relish. It's perfect for making ahead to let the flavors develop.This recipe for Old-Fashioned Potato Salad instructs you to boil unpeeled potatoes in salted water until they're tender but still firm. You'll drain them and let them cool a bit, then peel and chop into bite-sized pieces. (Boiling helps the potato skins slip off easily.) Depending on how large your potatoes are, boiling could take between 10 to 15 minutes or more. Start testing for doneness at about 10 minutes by piecing a potato with a sharp paring knife. If it slides in easily all the way to the center of the potato, the potato is cooked and ready to drain.",
  "category": "non-veg",
  "ingredients": "5 potatoes3 eggs1 cup chopped celery½ cup chopped onion½ cup sweet pickle relish¼ cup mayonnaise1 tablespoon prepared mustard¼ teaspoon garlic salt¼ teaspoon celery saltground black pepper to taste",
  "directions": "Gather all ingredients.|Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes.|Drain, cool, peel, and chop potatoes.|While potatoes cook, place eggs in a saucepan and cover with cold water. Bring water to a boil; cover, remove from heat, and let eggs stand in hot water for 10 to 12 minutes.|Remove from hot water, cool, peel, and chop eggs.|Combine the potatoes, eggs, celery, onion, relish, mayonnaise, mustard, garlic salt, celery salt, and pepper in a large bowl. Mix together well and refrigerate until chilled.|Enjoy!",
  "course": "Lunch",
  "rating": 4.5,
  "timeRequired": "1 hr",
  "nutrients": {
  "calories": 206,
  "fat": 8,
  "carbs": 31,
  "proteins": 6
  },
  "like": [],
  "comment": [],
  "createdAt": "23 July 2023"
  },
  {
  "_id": "64bac19be07ffc9ef4d57b82",
  "images": [
  "https://www.allrecipes.com/thmb/IEGqf_qHRUICpFJkgFsiat9oSZ4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/13313-best-cream-of-broccoli-soup-AllrecipesMagazine-4x3-495e6329745545a28c2a9b4e6ee3fab6.jpg",
  "https://www.allrecipes.com/thmb/m6S8aNwE-nPAJpUN6kr7W5Lf02c=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Best-Cream-of-Broccoli-Soup-AR-Step-3-5187f68664024e719cb636b6f9ab2905.jpg",
  "https://www.allrecipes.com/thmb/veiszRhH_QNe-3KmxVIeO6DSGs0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Best-Cream-of-Broccoli-Soup-AR-Step-2-8083f8be9c6d4378ba0f3e4b48effa24.jpg"
  ],
  "video": "",
  "name": "Best Cream Of Broccoli Soup",
  "description": "This broccoli soup recipe is thick and flavorful. It is simple, delicious, and quick to make. Enjoy (I know you will).Make restaurant-worthy cream of broccoli soup in the comfort of your own kitchen with this top-rated recipe. It's thick, flavorful, creamy, and easy to throw together on whim with simple ingredients.",
  "category": "veg",
  "ingredients": "5 tablespoons butter, divided|1 onion, chopped|1 stalk celery, chopped|3 cups chicken broth|8 cups broccoli florets|3 tablespoons all-purpose flour|2 cups milk|ground black pepper to taste",
  "directions": "Gather all ingredients.|Melt 2 tablespoons butter in a medium stock pot over medium heat. Saute onion and celery until tender.|Add broccoli and broth, cover, and simmer for 10 minutes.|Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use an immersion blender and puree the soup right in the cooking pot.|Melt 3 tablespoons butter in a small saucepan over medium to medium-low heat; stir in flour and add milk. Stir until thick and bubbly, and add to soup. Season with pepper and serve.|Serve hot and enjoy!",
  "course": "Lunch",
  "rating": 4.8,
  "timeRequired": "35 mins",
  "nutrients": {
  "calories": 207,
  "fat": 12,
  "carbs": 17,
  "proteins": 9
  },
  "like": [],
  "comment": [],
  "createdAt": "23 July 2023"
  }
  ]
  }